#!/usr/bin/python3

import matplotlib.pyplot as plt
import numpy as np

y = [35, 40, 45, 50, 55, 60, 65, 70, 75, 80, 85, 90, 95, 100, 105, 110,
     115, 120, 125, 130, 135, 140, 145, 150, 155, 160, 165, 170, 175, 180, 185]

x = [32, 37, 43, 45, 51, 57, 61, 66, 70, 77, 81, 85, 92, 104, 111, 114,
     117, 126, 131, 136, 139, 147, 153, 157, 150, 149, 150, 152, 150, 150, 150]
z1 = np.polyfit(x, y, 5)  # 用3次多项式拟合，输出系数从高到0
p1 = np.poly1d(z1)  # 使用次数合成多项式

print(p1)
y_pre = p1(x)
plt.title(p1)
plt.plot(x, y, '.')
plt.plot(x, y_pre)
plt.show()

